#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.python_lambda_package: Reading...
data.archive_file.python_lambda_package: Read complete after 0s [id=30b3f9a3e499312c27e67d373eb756b0cbd4ec40]
data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
data.aws_route53_zone.localcloud_zone: Reading...
data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_event_rule.cloudwatch_rule will be created
  + resource "aws_cloudwatch_event_rule" "cloudwatch_rule" {
      + arn            = (known after apply)
      + description    = "Alarms based on ec2 events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + state = [
                      + "running",
                      + "terminated",
                    ]
                }
              + detail-type = [
                  + "EC2 Instance State-change Notification",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "cloudwatch-rule-lambda"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-lambdaRole-waf"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.test-attach["arn:aws:iam::aws:policy/AWSLambdaExecute"] will be created
  + resource "aws_iam_role_policy_attachment" "test-attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSLambdaExecute"
      + role       = "lambda-lambdaRole-waf"
    }

  # aws_iam_role_policy_attachment.test-attach["arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "test-attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess"
      + role       = "lambda-lambdaRole-waf"
    }

  # aws_iam_role_policy_attachment.test-attach["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "test-attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonRoute53FullAccess"
      + role       = "lambda-lambdaRole-waf"
    }

  # aws_ssm_parameter.foo will be created
  + resource "aws_ssm_parameter" "foo" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "foo"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @Moglius, Action: `pull_request`*